tutorials/combustion/reactingFoam/RAS/chokedNozzle/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 292;

boundaryField
{
    inletair
    {
        type            uniformFixedValue;
        uniformValue
        {
            type            csvFile;
            nHeaderLine     1;
            refColumn       0;
            componentColumns ( 2 );
            separator       ",";
            mergeSeparators no;
            file            "<constant>/inlet.csv";
        }
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
